In [1]:
import pandas as pd
df = pd.read_csv('supershops.csv')

In [2]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# Min Max Scaler

In [3]:
from sklearn.preprocessing import MinMaxScaler
m = MinMaxScaler()
#m = MinMaxScaler(feature_range=(3,5))

In [4]:
scaled1 = m.fit(df[['Marketing Spend']])

In [5]:
scaled1

MinMaxScaler()

In [6]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [7]:
df['Marketing Spend'] = m.transform(df[['Marketing Spend']])

In [8]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [9]:
df.Administration = m.fit_transform(df[['Administration']])

In [10]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

In [11]:
df.Transport = m.fit_transform(df[['Transport']])

In [12]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

In [13]:
import pandas as pd
df = pd.read_csv('supershops.csv')

In [15]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [16]:
df.Administration.max()

182645.56

In [18]:
df.Administration = df.Administration / df.Administration.max()

In [19]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61        0.749527  471784.10    Dhaka  192261.83
1        162597.70        0.828805  443898.53      Ctg  191792.06
2        153441.51        0.553781  407934.54  Rangpur  191050.39
3        144372.41        0.649738  383199.62    Dhaka  182901.99
4        142107.34        0.500378  366168.42  Rangpur  166187.94

# Assignment

In [ ]:
do scaling on given dataset -
1. standard scaler
2. max abs scaler
3. robust scaler